"""
Задание 6
"""
word = input("Введите слово: ")

print(f"Результат: {word[((len(word)) - 1) // 2]}")